УТ_для_edt/src/InformationRegisters/CRM_ДанныеДляПоискаКонтактов/CRM_ДанныеДляПоискаКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДанныеДляПоискаКонтактов</name>
  <attributes>
    <name>ЗначениеПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактнойИнформации</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолеПоиска</name>
    <type>
      <types>EnumRef.CRM_ПоляПоискаКонтактов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контакт</name>
    <type>
      <types>DefinedType.CRM_КонтактДляПоиска</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.CRM_КонтактДляПоиска</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ИзменениеКонтактнойИнформации/CRM_ИзменениеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИзменениеКонтактнойИнформации</name>
  <attributes>
    <name>ВидКИ</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеКИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ДублиКлиентовИКонтактов/CRM_ДублиКлиентовИКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДублиКлиентовИКонтактов</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>Заменить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ПоляПоискаКонтактов/CRM_ПоляПоискаКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ПоляПоискаКонтактов</name>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>НаименованиеПолное</name>
  </enumValues>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>EMail</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_ПоискКонтактов/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет поиск контактов.
//
// Параметры:
//	УсловияПоиска		- Строка, Массив, Структура - Условия поиска.
//	СпособПоиска		- Число - Способ поиска.
//	ОграничиватьВыборку - Булево - Признак ограничения выборки.
//
// Возвращаемое значение:
//	Структура - результат поиска.
//
Функция ВыполнитьПоискКонтактов(Знач УсловияПоиска, Знач СпособПоиска = 1, Знач ОграничиватьВыборку = Ложь, ВернутьМестаНахождения = Ложь) Экспорт
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("КодОшибки", "");
	РезультатПоиска.Вставить("Элементы", Новый Массив);
	
	// Проверка и нормализация условий.
	Если Не ПроверитьУсловияПоиска(УсловияПоиска) Тогда
		РезультатПоиска.КодОшибки = "ОшибкаПоиска";
		Возврат РезультатПоиска;
	КонецЕсли;
	УсловияПоиска = НормализоватьУсловияПоиска(УсловияПоиска);
	
	// Поиск.
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	ИндексУсловия = 0;
	Для Каждого Условие Из УсловияПоиска Цикл
		
		СтрокаПоиска = ДополнитьСтрокуПоиска(Условие.СтрокаПоиска, СпособПоиска);
		Запрос.УстановитьПараметр("СтрокаПоиска"+ИндексУсловия, СтрокаПоиска);
		
		Если ИндексУсловия = 0 Тогда
			ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ" + ?(ОграничиватьВыборку, " ПЕРВЫЕ 300", "") + "
			|	ДанныеДляПоискаКонтактов.Владелец КАК Владелец,
			|	ДанныеДляПоискаКонтактов.ЗначениеПоиска КАК ЗначениеПоиска,
			|	ДанныеДляПоискаКонтактов.ПолеПоиска КАК ПолеПоиска,
			|	ДанныеДляПоискаКонтактов.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
			|	ДанныеДляПоискаКонтактов.Контакт КАК Контакт
			|ПОМЕСТИТЬ
			|	НайденныеДанные";
		Иначе
			ТекстЗапроса = ТекстЗапроса +
			"ВЫБРАТЬ" + ?(ОграничиватьВыборку, " ПЕРВЫЕ 300", "") + "
			|	ДанныеДляПоискаКонтактов.Владелец КАК Владелец,
			|	ДанныеДляПоискаКонтактов.ЗначениеПоиска КАК ЗначениеПоиска,
			|	ДанныеДляПоискаКонтактов.ПолеПоиска КАК ПолеПоиска,
			|	ДанныеДляПоискаКонтактов.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
			|	ДанныеДляПоискаКонтактов.Контакт КАК Контакт";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	РегистрСведений.CRM_ДанныеДляПоискаКонтактов КАК ДанныеДляПоискаКонтактов
		|ГДЕ
		|	ДанныеДляПоискаКонтактов.СтрокаПоиска ПОДОБНО &СтрокаПоиска" + ИндексУсловия;
		Если Условие.ПоляПоиска <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И ДанныеДляПоискаКонтактов.ПолеПоиска В (&ПоляПоиска" + ИндексУсловия + ")";
			Запрос.УстановитьПараметр("ПоляПоиска" + ИндексУсловия, Условие.ПоляПоиска);
		КонецЕсли;
		Если ИндексУсловия = УсловияПоиска.Количество() - 1 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|;
			|";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		
		ИндексУсловия = ИндексУсловия + 1;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ" + ?(ОграничиватьВыборку, " ПЕРВЫЕ 300", "") + "
	|	НайденныеДанные.Владелец КАК Владелец,
	|	НайденныеДанные.ЗначениеПоиска КАК ЗначениеПоиска,
	|	НайденныеДанные.ПолеПоиска КАК ПолеПоиска,
	|	НайденныеДанные.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	|	НайденныеДанные.Контакт КАК Контакт
	|ИЗ
	|	НайденныеДанные КАК НайденныеДанные";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		РезультатПоиска.КодОшибки = "НичегоНеНайдено";
		Возврат РезультатПоиска;
	КонецЕсли;
	
	Если ВернутьМестаНахождения Тогда
		ТаблицаРезультатов = РезультатЗапроса.Выгрузить();
		РезультатПоиска.Элементы = ТаблицаРезультатов.ВыгрузитьКолонку("Контакт");
		ТаблицаРезультатов.Свернуть("Владелец,ЗначениеПоиска,ВидКонтактнойИнформации,Контакт,ПолеПоиска");
		ТаблицаРезультатов.Колонки.Добавить("Партнер");
		Для Каждого Строка Из ТаблицаРезультатов Цикл
			Если ТипЗнч(Строка.Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Строка.Партнер = Строка.Контакт.Владелец;
			Иначе
				Строка.Партнер = Строка.Контакт;
			КонецЕсли;	
		КонецЦикла;	
		РезультатПоиска.Вставить("ТаблицаРезультатов", ТаблицаРезультатов);
	Иначе	
		РезультатПоиска.Элементы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
	КонецЕсли;	
	
	Возврат РезультатПоиска;
	
КонецФункции

// Форматирует номер для поиска.
//
// Параметры:
//	Номер - Строка - Номер для поиска.
//
// Возвращаемое значение:
//	Строка - форматированный номер для поиска.
//
Функция ФорматироватьНомерДляПоиска(Знач Номер) Экспорт
	
	Номер = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Номер, Ложь);
	КоличествоЗначимыхЦифр = сфпОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("сфпПоследниеЦифрыТелефонногоНомера");
	Если Не ЗначениеЗаполнено(КоличествоЗначимыхЦифр) Тогда
		КоличествоЗначимыхЦифр = 10;
	КонецЕсли;
	Если СтрДлина(Номер) > КоличествоЗначимыхЦифр Тогда
		Номер = Прав(Номер, КоличествоЗначимыхЦифр);
	КонецЕсли;
	
	Возврат Номер;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик записи контакта для поиска.
//
// Параметры:
//	Источник - СправочникСсылка - Источник.
//
Процедура КонтактДляПоискаПриЗаписи(Источник) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.CRM_ИзменениеКонтактнойИнформации.ДобавитьДанные(Источник.Ссылка);
	
	ОбновитьДанныеДляПоиска(Источник);
	
КонецПроцедуры

// Обновляет данные для поиска.
//
// Параметры:
//	ОбъектПоиска - СправочникСсылка - Объект поиска.
//
Процедура ОбновитьДанныеДляПоиска(ОбъектПоиска) Экспорт
	
	ПустойВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	
	ТипОбъекта = ТипЗнч(ОбъектПоиска);
	СвойстваОбъектов = ОписаниеСвойствОбъектовДляПоиска(ТипОбъекта);
	СвойстваТиповКИ = ОписаниеСвойствКонтактнойИнформацииДляПоиска();
	
	Контакт = ОбъектПоиска.Ссылка;
	CRM_ПоискКонтактовПереопределяемый.ПриОпределенииКонтактаДанныхПоиска(ТипОбъекта, Контакт, ОбъектПоиска);
	
	ДанныеДляПоиска = РегистрыСведений.CRM_ДанныеДляПоискаКонтактов.СоздатьНаборЗаписей();
	ДанныеДляПоиска.Отбор.Владелец.Установить(ОбъектПоиска.Ссылка);
	
	Для Каждого ОписаниеСвойства Из СвойстваОбъектов Цикл
		
		ЗначениеСвойства = СокрЛП(ОбъектПоиска[ОписаниеСвойства.Ключ]);
		Если Не ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДанныеДляПоиска.Добавить();
		НоваяСтрока.СтрокаПоиска			= ЗначениеСвойства;
		НоваяСтрока.ПолеПоиска				= ОписаниеСвойства.Значение;
		НоваяСтрока.Контакт					= Контакт;
		НоваяСТрока.Владелец				= ОбъектПоиска.Ссылка;
		НоваяСтрока.КлючУникальности		= Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.ЗначениеПоиска			= ЗначениеСвойства;
		НоваяСтрока.ВидКонтактнойИнформации	= ПустойВидКонтактнойИнформации;
		
	КонецЦикла;
	
	КонтактнаяИнформацияОбъекта = ОбъектПоиска.КонтактнаяИнформация;
	Если КонтактнаяИнформацияОбъекта.Количество() = 0 Тогда
		ДанныеДляПоиска.Записать();
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформацияОбъекта Цикл
		
		ТипКИ = СтрокаКИ.Тип;
		ПолеПоиска = СвойстваТиповКИ.Получить(ТипКИ);
		Если ПолеПоиска = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			СтрокаПоиска	= CRM_ПоискКонтактов.ФорматироватьНомерДляПоиска(СокрЛП(СтрокаКИ.НомерТелефона));
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			СтрокаПоиска	= СокрЛП(СтрокаКИ.АдресЭП);
		Иначе
			СтрокаПоиска	= СокрЛП(СтрокаКИ.Представление);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДанныеДляПоиска.Добавить();
		НоваяСТрока.СтрокаПоиска			= СтрокаПоиска;
		НоваяСтрока.ПолеПоиска				= ПолеПоиска;
		НоваяСтрока.Контакт					= Контакт;
		НоваяСТрока.Владелец				= ОбъектПоиска.Ссылка;
		НоваяСтрока.КлючУникальности		= Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.ЗначениеПоиска			= СтрокаКИ.Представление;
		НоваяСтрока.ВидКонтактнойИнформации	= СтрокаКИ.Вид;
		
	КонецЦикла;
	
	ДанныеДляПоиска.Записать();
	
КонецПроцедуры

#Область ПоискДублейПоЗначению

// Возвращает структуру данных кэша.
//
// Возвращаемое значение:
//	Структура - структура данных кэша.
//
Функция СтруктураДанныхКэша() Экспорт
	
	ДанныеКэша = Новый Структура;
	ДанныеКэша.Вставить("ИНН",			"");
	ДанныеКэша.Вставить("ФИО",			"");
	ДанныеКэша.Вставить("Организация",	"");
	ДанныеКэша.Вставить("Телефон",		"");
	ДанныеКэша.Вставить("Email",		"");
	ДанныеКэша.Вставить("URL",			"");
	
	Возврат ДанныеКэша;
	
КонецФункции

// Нормализует строку поиска и дополняет кэш.
//
// Параметры:
//	СтрокаПоиска  - Строка - Строка поиска.
//	КэшПоиска	  - Структура - Кэш поиска.
//	КэшЗаполнения - Структура - Кэш заполнения.
//
// Возвращаемое значение:
//	Строка - нормализованная строка поиска.
//
Функция НормализоватьСтрокуПоискаИДополнитьКэш(Знач СтрокаПоиска, КэшПоиска, КэшЗаполнения) Экспорт
	
	Если РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Истина, "") Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ИНН) Тогда
			КэшПоиска.ИНН = СтрокаПоиска;
			КэшЗаполнения.ИНН = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Ложь, "") Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ИНН) Тогда
			КэшПоиска.ИНН = СтрокаПоиска;
			КэшЗаполнения.ИНН = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли Взаимодействия.КорректноВведенНомерТелефона(СтрокаПоиска) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Телефон) Тогда
			КэшПоиска.Телефон = CRM_ПоискКонтактов.ФорматироватьНомерДляПоиска(СтрокаПоиска);
			СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаПоиска);
			КэшЗаполнения.Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураКИ.КодСтраны, СтруктураКИ.КодГорода, СтруктураКИ.НомерТелефона, "", "");
		КонецЕсли;
		СтрокаПоиска = КэшПоиска.Телефон;
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(СтрокаПоиска, Истина) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Email) Тогда
			КэшПоиска.Email = СтрокаПоиска;
			КэшЗаполнения.Email = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли CRM_ОбщегоНазначенияКлиентСервер.ЭтоURL(СтрокаПоиска) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.URL) Тогда
			КэшПоиска.URL = СтрокаПоиска;
			КэшЗаполнения.URL = СтрокаПоиска;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ФИО) Тогда
			КэшПоиска.ФИО = СтрокаПоиска;
			КэшЗаполнения.ФИО = CRM_КлиентыСервер.ПривестиФИОКСтандартномуВиду(СтрокаПоиска);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Организация) Тогда
			КэшПоиска.Организация = СтрокаПоиска;
			КэшЗаполнения.Организация = СтрокаПоиска;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции

// Создает структуру поиска.
//
// Возвращаемое значение:
//	Структура - структура поиска.
//
Функция СоздатьСтруктуруПоиска() Экспорт
	
	СтруктураПоиска = Новый Структура;
	
	ЗначениеХранилища = Константы.CRM_РеквизитыПоискаДублейПартнеров.Получить();
	РеквизитыПоиска = ЗначениеХранилища.Получить();
	Если РеквизитыПоиска <> Неопределено Тогда
		Если ТипЗнч(РеквизитыПоиска) = Тип("СписокЗначений") Тогда
			Для Каждого СтрокаСписка Из РеквизитыПоиска Цикл
				Если СтрокаСписка.Пометка Тогда	
					Значение = СтрокаСписка.Значение;
					ТочкаСЗапятой = Найти(Значение,";");
		
					СтруктураПоиска.Вставить(Сред(Значение,1,ТочкаСЗапятой-1),Сред(Значение,ТочкаСЗапятой+1));
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураПоиска;
	
КонецФункции

// Возвращает текст запроса поиска дублей.
//
// Возвращаемое значение:
//	Строка - текст запроса поиска дублей.
//
Функция ТекстЗапросаПоискаДублей() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НайденныеСсылки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НайденныеСсылкиВТ
	|ИЗ
	|	&НайденныеСсылки КАК НайденныеСсылки
	|ГДЕ
	|	(&ТекущийОбъектНеЗадан
	|			ИЛИ НайденныеСсылки.Ссылка <> &ТекущийОбъект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НайденныеСсылкиВТ.Ссылка КАК Ссылка,
	|	"""" КАК Оригинал
	|ПОМЕСТИТЬ НайденныеСсылкиВТ2
	|ИЗ
	|	НайденныеСсылкиВТ КАК НайденныеСсылкиВТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДублиКлиентовИКонтактов.Оригинал,
	|	&ДополнениеОригиналаКлиента
	|ИЗ
	|	РегистрСведений.CRM_ДублиКлиентовИКонтактов КАК ДублиКлиентовИКонтактов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылкиВТ КАК НайденныеСсылкиВТ
	|		ПО ДублиКлиентовИКонтактов.Контакт = НайденныеСсылкиВТ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеСсылкиВТ2.Ссылка КАК Ссылка,
	|	МАКСИМУМ(НайденныеСсылкиВТ2.Оригинал) КАК Оригинал
	|ПОМЕСТИТЬ НайденныеСсылки
	|ИЗ
	|	НайденныеСсылкиВТ2 КАК НайденныеСсылкиВТ2
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеСсылкиВТ2.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Клиенты.Ссылка КАК КлиентКонтакт,
	|	&СтрокаКлиент + НайденныеСсылки.Оригинал КАК ПредставлениеКлиентаКонтакта,
	|	Клиенты.Представление КАК Представление,
	|	Клиенты.ОсновнойМенеджер КАК ОсновнойМенеджер
	|ПОМЕСТИТЬ ДанныеКлиентов
	|ИЗ
	|	Справочник.Партнеры КАК Клиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО Клиенты.Ссылка = НайденныеСсылки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контакты.Ссылка,
	|	&СтрокаКонтакт + НайденныеСсылки.Оригинал,
	|	Контакты.Представление,
	|	Клиенты.ОсновнойМенеджер
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО Контакты.Ссылка = НайденныеСсылки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Клиенты
	|		ПО Контакты.Владелец = Клиенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПотенциальныеКлиенты.Ссылка,
	|	&СтрокаПотенциальныйКлиент,
	|	ПотенциальныеКлиенты.Представление,
	|	ПотенциальныеКлиенты.ОсновнойМенеджер
	|ИЗ
	|	Справочник.CRM_ПотенциальныеКлиенты КАК ПотенциальныеКлиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
	|		ПО ПотенциальныеКлиенты.Ссылка = НайденныеСсылки.Ссылка
	|ГДЕ
	|	ПотенциальныеКлиенты.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеКлиентов.КлиентКонтакт КАК КлиентКонтакт,
	|	ДанныеКлиентов.ПредставлениеКлиентаКонтакта КАК ПредставлениеКлиентаКонтакта,
	|	ДанныеКлиентов.Представление КАК Представление,
	|	ДанныеКлиентов.ОсновнойМенеджер КАК ОсновнойМенеджер,
	|	&КомандаВыбрать КАК КомандаВыбрать,
	|	&ЗначениеПоиска КАК ЗначениеПоиска,
	|	ИСТИНА КАК Доступен
	|ИЗ
	|	ДанныеКлиентов КАК ДанныеКлиентов";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Создает структуру параметров запроса.
//
// Возвращаемое значение:
//	Структура - структура параметров запроса.
//
Функция ПараметрыЗапросов() Экспорт
	
	ПараметрыЗапросов = Новый Структура;
	ПараметрыЗапросов.Вставить("НадписьПотенциальногоКлиента",		НСтр("ru='Потенциальный клиент';en='Potential Customer'"));
	ПараметрыЗапросов.Вставить("ДополнениеПотенциальногоКлиента",	"(" + НСтр("ru='потенц. клиент';en='potential customer'") + ")");
	ПараметрыЗапросов.Вставить("ДополнениеУволенногоКонтакта",		"(" + НСтр("ru='уволен';en='fired'") + ")");
	ПараметрыЗапросов.Вставить("ДополнениеНеРаботающегоКонтакта",	"(" + НСтр("ru='временно не работает';en='not work temporarily'") + ")");
	ПараметрыЗапросов.Вставить("ДополнениеКлиентаФизическогоЛица",	"(" + НСтр("ru='физ.лицо';en='individual'") + ")");
	ПараметрыЗапросов.Вставить("ДополнениеОригиналаКлиента",		" (" + НСтр("ru = 'оригинал'") + ")");
	
	Возврат ПараметрыЗапросов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьУсловияПоиска(УсловияПоиска)
	
	Результат = Истина;
	
	Если ТипЗнч(УсловияПоиска) = Тип("Строка") Тогда
		
		Если СтрДлина(УсловияПоиска) < 3 Тогда
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(УсловияПоиска) = Тип("Массив") Тогда
		
		Если УсловияПоиска.Количество() = 0 Тогда
			Результат = Ложь;
		Иначе
			Для Каждого Условие Из УсловияПоиска Цикл
				
				Если ТипЗнч(Условие) = Тип("Строка") Тогда
					Если СтрДлина(Условие) < 3 Тогда
						Результат = Ложь;
					КонецЕсли;
				ИначеЕсли ТипЗнч(Условие) = Тип("Структура") Тогда
					Если Не Условие.Свойство("СтрокаПоиска") ТОгда
						Результат = Ложь;
					КонецЕсли;
					Если Не Условие.Свойство("ПоляПоиска") ТОгда
						Результат = Ложь;
					КонецЕсли;
				Иначе
					Результат = Ложь;
				КонецЕсли;
				
				Если Не Результат Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(УсловияПоиска) = Тип("Структура") Тогда
		
		Если Не УсловияПоиска.Свойство("СтрокаПоиска") ТОгда
			Результат = Ложь;
		КонецЕсли;
		Если Не УсловияПоиска.Свойство("ПоляПоиска") ТОгда
			Результат = Ложь;
		КонецЕсли;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НормализоватьУсловияПоиска(УсловияПоиска)
	
	УсловияНормализованные = Новый Массив;
	
	Если ТипЗнч(УсловияПоиска) = Тип("Строка") Тогда
		
		СтруктураУсловия = Новый Структура;
		СтруктураУсловия.Вставить("СтрокаПоиска", УсловияПоиска);
		СтруктураУсловия.Вставить("ПоляПоиска", Неопределено);
		УсловияНормализованные.Добавить(СтруктураУсловия);
		
	ИначеЕсли ТипЗнч(УсловияПоиска) = Тип("Массив") Тогда
		
		Для Каждого Условие Из УсловияПоиска Цикл
			
			Если ТипЗнч(Условие) = Тип("Строка") Тогда
				
				СтруктураУсловия = Новый Структура;
				СтруктураУсловия.Вставить("СтрокаПоиска", Условие);
				СтруктураУсловия.Вставить("ПоляПоиска", Неопределено);
				УсловияНормализованные.Добавить(СтруктураУсловия);
				
			ИначеЕсли ТипЗнч(Условие) = Тип("Структура") Тогда
				
				УсловияНормализованные.Добавить(Условие);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(УсловияПоиска) = Тип("Структура") Тогда
		
		УсловияНормализованные.Добавить(УсловияПоиска);
		
	КонецЕсли;
	
	Возврат УсловияНормализованные;
	
КонецФункции

Функция ОписаниеСвойствОбъектовДляПоиска(ТипОбъекта)
	
	ОписаниеСвойств = Новый Структура;
	ОписаниеСвойств.Вставить("Наименование", Перечисления.CRM_ПоляПоискаКонтактов.Наименование);
	
	Если ТипОбъекта = Тип("СправочникОбъект.Партнеры") Тогда
		ОписаниеСвойств.Вставить("НаименованиеПолное", Перечисления.CRM_ПоляПоискаКонтактов.НаименованиеПолное);
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ОписаниеСвойств.Вставить("CRM_ИНН", Перечисления.CRM_ПоляПоискаКонтактов.ИНН);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.CRM_ПотенциальныеКлиенты") Тогда
		ОписаниеСвойств.Вставить("Организация", Перечисления.CRM_ПоляПоискаКонтактов.Прочее);
	КонецЕсли;
	
	CRM_ПоискКонтактовПереопределяемый.ПриОпределенииОписанияСвойствОбъектовДляПоиска(ТипОбъекта, ОписаниеСвойств);
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ОписаниеСвойствКонтактнойИнформацииДляПоиска()
	
	ОписаниеСвойств = Новый Соответствие;
	
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.Адрес,
		Перечисления.CRM_ПоляПоискаКонтактов.Адрес);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.Телефон,
		Перечисления.CRM_ПоляПоискаКонтактов.Телефон);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		Перечисления.CRM_ПоляПоискаКонтактов.EMail);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.Skype,
		Перечисления.CRM_ПоляПоискаКонтактов.Прочее);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.ВебСтраница,
		Перечисления.CRM_ПоляПоискаКонтактов.Прочее);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.Факс,
		Перечисления.CRM_ПоляПоискаКонтактов.Прочее);
	ОписаниеСвойств.Вставить(Перечисления.ТипыКонтактнойИнформации.Другое,
		Перечисления.CRM_ПоляПоискаКонтактов.Прочее);
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ДополнитьСтрокуПоиска(Знач СтрокаПоиска, СпособПоиска)
	
	Если СпособПоиска = 0 Тогда
		СтрокаПоиска = СтрокаПоиска + "%";
	ИначеЕсли СпособПоиска = 1 Тогда
		СтрокаПоиска = "%" + СтрокаПоиска + "%";
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции

#КонецОбласти
